In [1]:
import pandas as pd
import numpy as np

In [5]:
dfe=[[1.0,5.0,1],[2.0,np.NaN,2],[np.nan,np.nan,3]]
df = pd.DataFrame(dfe,index=(0,1,2),columns=["A","B","C"])
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [8]:
df2 = pd.DataFrame({'A':[1,2,np.nan],
                   'b':[5,np.nan,np.nan],
                   'c':[1,2,3]})
df2
# 딕셔너리 형태로 만들기 가능

     A    b  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [9]:
df.dropna()

     A    B  C
0  1.0  5.0  1

axix = 0 는 행

axix = 1 는 열

NaN이 있는 컬럼을 제외하고

In [39]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [58]:
df.dropna(thresh=1)
# 행 중에 정상적인 것이 1개 이상이면 표시

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [59]:
df.dropna(thresh=2)
# 행 중에 정상적인 것이 2개 이상이면 표시

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [60]:
df.dropna(thresh=3)
# 행 중에 정상적인 것이 3개 이상이면 표시

     A    B  C
0  1.0  5.0  1

In [61]:
df.fillna(value="FILL YALUE")

            A           B  C
0         1.0         5.0  1
1         2.0  FILL YALUE  2
2  FILL YALUE  FILL YALUE  3

In [62]:
df.fillna(value=4)

     A    B  C
0  1.0  5.0  1
1  2.0  4.0  2
2  4.0  4.0  3

In [63]:
df['A'].fillna(value=df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64